#### Terraform Plan ('src/domains/selfcare/prod/westeurope') 📖
<details>
<summary>Terraform Plan</summary>

```hcl
module.app_services.data.azurerm_linux_function_app.itn_webapp_functions_app: Still reading... [10s elapsed]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.app_services.module.appservice_devportal_be.azurerm_linux_web_app.this will be updated in-place
  ~ resource "azurerm_linux_web_app" "this" {
      ~ app_settings                                   = {
          ~ "USE_SERVICE_PRINCIPAL"                        = "1" -> "0"
            # (51 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-selfcare-be-rg/providers/Microsoft.Web/sites/io-p-app-devportal-be"
        name                                           = "io-p-app-devportal-be"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Enti & Servizi"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-infra/blob/main/src/domains/selfcare/prod/westeurope"
        }
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.app_services.module.selfcare_jwt.azurerm_key_vault_secret.jwt_cert will be updated in-place
  ~ resource "azurerm_key_vault_secret" "jwt_cert" {
        id                      = "https://io-p-kv-common.vault.azure.net/secrets/selfcare-jwt-cert/4c7cc906c39f4de7900b5f3756a633d4"
        name                    = "selfcare-jwt-cert"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (6 unchanged attributes hidden)
    }

  # module.app_services.module.selfcare_jwt.tls_self_signed_cert.jwt_self must be replaced
-/+ resource "tls_self_signed_cert" "jwt_self" {
      ~ cert_pem              = <<-EOT
            -----BEGIN CERTIFICATE-----
            MIIDWzCCAkOgAwIBAgIRAMR7Rjfee0k53F5R9xpyew4wDQYJKoZIhvcNAQELBQAw
            WDEJMAcGA1UEBhMAMQkwBwYDVQQIEwAxCTAHBgNVBAcTADEJMAcGA1UEERMAMQkw
            BwYDVQQKEwAxCTAHBgNVBAsTADEUMBIGA1UEAxMLSU8gc2VsZmNhcmUwHhcNMjMx
            MTIzMTcwOTIyWhcNMjQxMTE3MTcwOTIyWjBYMQkwBwYDVQQGEwAxCTAHBgNVBAgT
            ADEJMAcGA1UEBxMAMQkwBwYDVQQREwAxCTAHBgNVBAoTADEJMAcGA1UECxMAMRQw
            EgYDVQQDEwtJTyBzZWxmY2FyZTCCASIwDQYJKoZIhvcNAQEBBQADggEPADCCAQoC
            ggEBALcVjp4Igj5Ohmc4tKgvR6QlRzfpvNLLManh4FoHaCtiS4uPIqGu3IhG/aAq
            0nl4/4uuIwAcXhjy6vgbRncwcwDEUHdOVhLlLn9Qewf+RzoKCUvnSNS8q476Rt0g
            lla48quP2BAinW/v6t646Abh2+8TeKqZbKN1FNC/7xw9fdU4WPAquykZ6f7C4Lkj
            T1wPDK7jrXY2N+Sg+GX+7Awn5csqKEoezh8AX4evmh899Y2J5rt8eSIa8ibT5zav
            3WuFud9fEUSnZXJ+5hBNuj1FLnm9o4MaHHzZt5azFbHVwYgu31zMu+EEgdKEvIvr
            DorBxOrjErWM55KNOLv5UNr5Js8CAwEAAaMgMB4wDgYDVR0PAQH/BAQDAgeAMAwG
            A1UdEwEB/wQCMAAwDQYJKoZIhvcNAQELBQADggEBABAjiszFWFSa2aCP+qnXiamH
            06oOnY7iN9DFmyFaplpz5JddQtieSujUYzApnxOCDKyNpaJC8bYzLYadLDVOIIqE
            GSpLV64jlpv4yvoM7BFmOa7FnhAbQAOhQrBSd48HdYkpllpaQVpW2RA2yrCB+RVU
            Uy4eAmdS9SXWS8qSGedVudgFpAO2wpv+u9L0MJ4A8x0L11Rqyn4pdwx9iBit+ZBj
            XCqgjv2JHB7ak3v7w28CTBwFtH4Pa09x8nV7Nnd1v9vZslL49cwcUwz7SQTlZAnb
            QA838TOpzz/AGXVGKPtIKNyVb1V1zaQw90lzolFAoDnZskcJf38T9GjyVaGDEng=
            -----END CERTIFICATE-----
        EOT -> (known after apply)
      ~ id                    = "261168763882519204645171764604781624078" -> (known after apply)
      ~ key_algorithm         = "RSA" -> (known after apply)
      ~ ready_for_renewal     = true -> false # forces replacement
      ~ validity_end_time     = "2024-11-17T17:09:22.924416878Z" -> (known after apply)
      ~ validity_start_time   = "2023-11-23T17:09:22.924416878Z" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.postgresql.module.subscriptionmigrations_db_server.azurerm_management_lock.this[0] will be created
  + resource "azurerm_management_lock" "this" {
      + id         = (known after apply)
      + lock_level = "CanNotDelete"
      + name       = "io-p-subsmigrations-db-postgresql-lock"
      + notes      = "This items can't be deleted in this subscription!"
      + scope      = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-selfcare-be-rg/providers/Microsoft.DBforPostgreSQL/servers/io-p-subsmigrations-db-postgresql"
    }

Plan: 2 to add, 2 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
